Catalogs/упГрузовыеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГрузовыеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БеречьОтВлаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтИзлучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтНагрева</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаяФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упДоступныеФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноПробитиеЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноСкладироватьДругНаДруга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГрузПоЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПредоплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хрупкий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварныйСоставГруза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНоменклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упУпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упВидыГрузов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыГрузов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Груз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассируемаяЦенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упНоменклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упНоменклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемНетто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковкаДляОтчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упУпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упТемпературныеРежимы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТемпературныеРежимы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТемператураОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упГрузовыеМеста/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.Свойство("ЗаявкаНаПеревозку") И ЗначениеЗаполнено(Параметры.ЗаявкаНаПеревозку) Тогда
			сткРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ЗаявкаНаПеревозку, "Дата, Номер");
			Объект.Код = Формат(сткРеквизиты.Дата, "ДФ=гг") + СокрЛП(сткРеквизиты.Номер) + ?(Параметры.Свойство("СчетчикГрузов"), "-" + Параметры.СчетчикГрузов, "");
			Объект.ДокументОснование = Параметры.ЗаявкаНаПеревозку
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьДоступность();
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
    ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ЕИ_Длины  = упСервисныеФункции.ПолучитьЗначениеКонстанты("упЕдиницаИзмеренияЛинейныхГабаритов");
	ЭтаФорма.ЕИ_Объем  = упСервисныеФункции.ПолучитьЗначениеКонстанты("упЕдиницаИзмеренияОбъема");
	ЭтаФорма.ЕИ_Масса  = упСервисныеФункции.ПолучитьЗначениеКонстанты("упЕдиницаИзмеренияМассы");
	ЭтаФорма.ЕИ_Грузов = упСервисныеФункции.ПолучитьЗначениеКонстанты("упЕдиницаИзмеренияГрузовыхМест");
	ЭтаФорма.КоэффициентПересчетаОбъема = упСервисныеФункции.ПолучитьЗначениеКонстанты("упКоэффициентПересчетаОбъема");
	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьЛинейныеРазмеры") И Не ПолучитьФункциональнуюОпцию("упУчитыватьОбъем") Тогда 
		Элементы.ГруппаШГВ.Видимость              = Ложь;
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьОбъем") Тогда 
		Элементы.ГруппаОбъем.Видимость            = Ложь;
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьМассу") Тогда 
		Элементы.ГруппаГрузоподъемность.Видимость = Ложь;
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест") Тогда 
		Элементы.ГруппаКоличествоМест.Видимость   = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	ЭтаФорма.ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	Если ЭтаФорма.ВедетсяВалютныйУчет Тогда
		 ЭтаФорма.ВалютаУпрУчета = упСервисныеФункцииВызовСервера.ВалютаУправленческогоУчета();	
	КонецЕсли;

	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	ЭтоНовый = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства,"Создание", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Источник = Объект.ТипГруза Тогда
		УстановитьДоступность();			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ЭтоНовый Тогда
			Оповестить("Справочник.упГрузовыеМеста.Создание", Объект.ДокументОснование, Объект.Ссылка);
		Иначе	
			Оповестить("Справочник.упГрузовыеМеста.Запись", Объект.ДокументОснование, Объект.Ссылка);	
		КонецЕсли;
		ЭтоНовый = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипГрузаПриИзменении(Элемент)
	
	ОбновитьЭлементыДополнительныхРеквизитов();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)

	ПриИзмененииРазмеров();
	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)

	ПриИзмененииРазмеров();
	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)

	ПриИзмененииРазмеров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРазмеров()

	Объект.Объем = Объект.Ширина * Объект.Высота * Объект.Длина * КоэффициентПересчетаОбъема;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьИтоговыеСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаПослеУдаления(Элемент)
	ПересчитатьИтоговыеСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаЦенаПриИзменении(Элемент)

	упОбработкаТабличнойЧастиКлиент.ТоварныйСоставГрузаРассчитатьСуммы(Элементы.ТоварныйСоставГруза.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаКоличествоПриИзменении(Элемент)

	упОбработкаТабличнойЧастиКлиент.ТоварныйСоставГрузаРассчитатьСуммы(Элементы.ТоварныйСоставГруза.ТекущиеДанные);
	
	РассчитатьВГХГруза();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаСуммаПриИзменении(Элемент)

	упОбработкаТабличнойЧастиКлиент.ТоварныйСоставГрузаСуммаПриИзменении(Элементы.ТоварныйСоставГруза.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаСтавкаНДСПриИзменении(Элемент)

	упОбработкаТабличнойЧастиКлиент.ТоварныйСоставГрузаРассчитатьСуммы(Элементы.ТоварныйСоставГруза.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаНоменклатураПриИзменении(Элемент)
	
	ТоварныйСоставГрузаНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТоварныйСоставГрузаНоменклатураПриИзмененииНаСервере()

	РассчитатьВГХГруза();
	
	мсвНоменклатуры = Неопределено;
	Если ПолучитьФункциональнуюОпцию("упУчитыватьКлассыОпасностиГрузов") Тогда 
		мсвНоменклатуры = Объект.ТоварныйСоставГруза.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упНоменклатура.КлассОпасности
		|ИЗ
		|	Справочник.упНоменклатура КАК упНоменклатура
		|ГДЕ
		|	упНоменклатура.Ссылка В(&Ссылка)
		|	И упНоменклатура.КлассОпасности <> ЗНАЧЕНИЕ(Справочник.упКлассыОпасности.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	упНоменклатура.КлассОпасности.Класс";
		Запрос.УстановитьПараметр("Ссылка", мсвНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Объект.КлассОпасности = Выборка.КлассОпасности;
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("упКонтролироватьТемпературныеРежимы") Тогда 
		Если мсвНоменклатуры = Неопределено Тогда 
			мсвНоменклатуры = Объект.ТоварныйСоставГруза.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МАКСИМУМ(упНоменклатура.ТемпературныйРежим.ТемператураОт) КАК ТемпературныйРежимТемператураОт,
		|	МИНИМУМ(упНоменклатура.ТемпературныйРежим.ТемператураДо) КАК ТемпературныйРежимТемператураДо
		|ПОМЕСТИТЬ втДопустимыйДиапазон
		|ИЗ
		|	Справочник.упНоменклатура КАК упНоменклатура
		|ГДЕ
		|	упНоменклатура.Ссылка В(&Ссылка)
		|	И упНоменклатура.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныережимы.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упТемпературныеРежимы.Ссылка,
		|	упТемпературныеРежимы.ТемператураДо - упТемпературныеРежимы.ТемператураОт КАК Порядок
		|ИЗ
		|	Справочник.упТемпературныеРежимы КАК упТемпературныеРежимы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДопустимыйДиапазон КАК втДопустимыйДиапазон
		|		ПО упТемпературныеРежимы.ТемператураОт >= втДопустимыйДиапазон.ТемпературныйРежимТемператураОт
		|			И упТемпературныеРежимы.ТемператураДо <= втДопустимыйДиапазон.ТемпературныйРежимТемператураДо
		|ГДЕ
		|	НЕ упТемпературныеРежимы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок УБЫВ";
		Запрос.УстановитьПараметр("Ссылка", мсвНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Объект.ТемпературныйРежим = Выборка.Ссылка;
		Иначе
			Объект.ТемпературныйРежим = Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьВГХГруза(Параметр = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	тбТовары.Номенклатура,
	|	тбТовары.УпаковкаНоменклатуры,
	|	тбТовары.Количество
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&тбТовары КАК тбТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(упУпаковкиНоменклатуры.Масса, упНоменклатура.Масса) * втТовары.Количество) КАК Масса,
	|	СУММА(ЕСТЬNULL(упУпаковкиНоменклатуры.Объем, упНоменклатура.Объем) * втТовары.Количество) КАК Объем
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упНоменклатура КАК упНоменклатура
	|		ПО втТовары.Номенклатура = упНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упУпаковкиНоменклатуры КАК упУпаковкиНоменклатуры
	|		ПО втТовары.УпаковкаНоменклатуры = упУпаковкиНоменклатуры.Ссылка";
	Запрос.УстановитьПараметр("тбТовары", Объект.ТоварныйСоставГруза.Выгрузить(, "Номенклатура, УпаковкаНоменклатуры, Количество"));
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если ЗначениеЗаполнено(Выборка.Масса) И (Выборка.Масса > Объект.Масса ИЛИ Параметр = "Масса") Тогда 
			Объект.Масса = Выборка.Масса;
		ИначеЕсли Параметр = "Масса" Тогда 
			Объект.Масса = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Объем) И (Выборка.Объем > Объект.Объем ИЛИ Параметр = "Объем") Тогда 
			Объект.Объем = Выборка.Объем;
		ИначеЕсли Параметр = "Объем" Тогда 
			Объект.Объем = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСоставГрузаУпаковкаНоменклатурыПриИзменении(Элемент)
	
	РассчитатьВГХГруза();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьОбъем(Команда)
	
	РассчитатьВГХГруза("Объем");
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМассу(Команда)
	
	РассчитатьВГХГруза("Масса");
	
КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияРеквизитовОбъектов

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов.
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	  
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПересчитатьИтоговыеСуммы()
	Объект.Сумма 	= Объект.ТоварныйСоставГруза.Итог("Сумма");
	Объект.СуммаНДС = Объект.ТоварныйСоставГруза.Итог("СуммаНДС");		
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	ВидГруза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипГруза, "ВидГруза"); 
	
	Если ВидГруза = Перечисления.упВидыГрузов.Тара Тогда
		Элементы.ГруппаВалюта.ТекущаяСтраница = Элементы.ГруппаВалютаГруз;
		Элементы.ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки.Видимость = Ложь;
		Элементы.ДоступнаяФормаОплаты.Видимость = Ложь;
	ИначеЕсли ВидГруза = Перечисления.упВидыГрузов.Груз Тогда
		Элементы.ГруппаВалюта.ТекущаяСтраница = Элементы.ГруппаВалютаГруз;
		Элементы.ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки.Видимость = Истина;
		Элементы.ДоступнаяФормаОплаты.Видимость = Истина;
		Элементы.ДоступнаяФормаОплаты.Доступность = Объект.ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки;
	ИначеЕсли ВидГруза = Перечисления.упВидыГрузов.ИнкассируемаяЦенность Тогда
		Элементы.ГруппаВалюта.ТекущаяСтраница = Элементы.ГруппаВалютаИнкассируемаяЦенность;
		Элементы.ДоступнаяФормаОплаты.Видимость = Истина;
		Элементы.ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки.Видимость = Ложь;
	КонецЕсли; 
		
КонецПроцедуры // УстановитьДоступность()

&НаКлиенте
Процедура ТоварныйСоставГрузаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ТоварныйСоставГрузаНоменклатура Тогда
		Если Ложь
			Или ТолькоПросмотр
			Или Элементы.ТоварныйСоставГруза.ТолькоПросмотр
			Или Поле.ТолькоПросмотр
		Тогда
			ПоказатьЗначение(, Объект.ТоварныйСоставГруза.НайтиПоИдентификатору(ВыбраннаяСтрока).Номенклатура);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
